# Brew taps
tap 'homebrew/cask'
tap 'borkdude/brew'
tap 'heroku/brew'
tap 'AdoptOpenJDK/openjdk'
tap 'koekeishiya/formulae'
tap 'homebrew/cask-fonts'
tap 'd12frosted/emacs-plus'

# Standard brew install
brew 'curl'
brew 'openssl'
brew 'readline'
brew 'gcc'
brew 'git'
brew 'automake'
brew 'pkg-config'
brew 'tree-sitter'
brew 'luajit'
brew 'neovim'
brew 'gpg2'
brew 'starship'
brew 'coreutils'
brew 'zsh'
brew 'fish'
brew 'fzf'
brew 'go'
brew 'jq'
brew 'zlib'
brew 'leiningen'
brew 'cmake'
brew 'pngpaste'
brew 'rust-analyzer'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'direnv'
brew 'tmux'
brew 'emacs-plus@29'
brew 'clojure-lsp/brew/clojure-lsp-native'

# cask installs
cask '1password'
cask 'iterm2'
cask 'discord'
cask 'slack'
cask 'rectangle'
cask 'iina'
cask 'visual-studio-code'
cask 'adoptopenjdk8'
cask 'adoptopenjdk16'
cask 'raycast'
cask 'secretive'

# font stuff
cask 'font-juliamono'
