# Brew taps
tap 'homebrew/cask'
tap 'AdoptOpenJDK/openjdk'
tap 'koekeishiya/formulae'
tap 'homebrew/cask-fonts'

# Standard brew install
brew 'asdf'
brew 'curl'
brew 'openssl'
brew 'readline'
brew 'gcc'
brew 'git'
brew 'automake'
brew 'pkg-config'
brew 'tree-sitter'
brew 'luajit'
brew 'neovim'
brew 'gpg2'
brew 'starship'
brew 'coreutils'
brew 'zsh'
brew 'fish'
brew 'fzf'
brew 'go'
brew 'jq'
brew 'zlib'
brew 'cmake'
brew 'pngpaste'
brew 'rust-analyzer'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'direnv'
brew 'tmux'
brew 'zoxide'
brew 'node'
brew 'exa'
brew 'lsd'

# cask installs
cask 'iterm2'
cask 'discord'
cask 'slack'
cask 'rectangle'
cask 'iina'
cask 'visual-studio-code'
cask 'raycast'
cask 'bitwarden'
cask 'cleanshot'
cask 'firefox'
cask 'spotify'
cask 'yubico-authenticator'

# font stuff
cask 'font-juliamono'
cask 'font-jetbrains-mono-nerd-font'
