# Brew taps
tap 'homebrew/cask'
tap 'railwaycat/emacsmacport'
tap 'borkdude/brew'
tap 'heroku/brew'
tap 'AdoptOpenJDK/openjdk'
tap 'koekeishiya/formulae'

# Standard brew install
brew 'curl'
brew 'openssl'
brew 'readline'
brew 'gcc'
brew 'git'
brew 'automake'
brew 'pkg-config'
brew 'tree-sitter', args: ['HEAD']
brew 'luajit', args: ['HEAD']
brew 'neovim', args: ['HEAD']
brew 'mas'
brew 'mu'
brew 'isync'
brew 'msmtp'
brew 'gpg2'
brew 'starship'
brew 'coreutils'
brew 'zsh'
brew 'fish'
brew 'fzf'
brew 'go'
brew 'ripgrep'
brew 'exa'
brew 'fd'
brew 'lsd'
brew 'xsv'
brew 'jq'
brew 'zlib'
brew 'python'
brew 'python3'
brew 'clojure'
brew 'leiningen'
brew 'clj-kondo'
brew 'rbenv'
brew 'cmake'
brew 'pngpaste'
brew 'bat'
brew 'heroku'
brew 'frum'
brew 'rust-analyzer'
brew 'jesseduffield/lazygit/lazygit'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'cmacrae/formulae/spacebar'
brew 'direnv'
brew 'ruby-install'
brew 'fnm'
brew 'grep'
brew 'graphviz'
brew 'gnuplot'
brew 'pyenv'
brew 'sbcl'
brew 'roswell'

# cask installs
cask '1password'
cask 'google-chrome'
cask 'firefox'
cask 'spotify'
cask 'steam'
cask 'iterm2'
cask 'discord'
cask 'slack'
cask 'emacs-mac'
cask 'rectangle'
cask 'hey'
cask 'iina'
cask 'cloudapp'
cask 'visual-studio-code'
cask 'adoptopenjdk8'
cask 'adoptopenjdk16'
cask 'kitty'
cask 'raycast'
cask 'tableplus'

# mas installs
mas 'NextDNS', id: 1_464_122_853
mas 'Deliveries: a package tracker', id: 29_098_6013
# Ignore installing Xcode through mas...it will often show up as 'updated' but it hasn't been and is instead just redownloading 13gigs of ~~Trash~~ Xcode
# mas 'Xcode', id: 497_799_835
