jorgebucaran/fisher
jorgebucaran/replay.fish
jethrokuan/z
acomagu/fish-async-prompt
jorgebucaran/autopair.fish
franciscolourenco/done
lilyball/nix-env.fish
pure-fish/pure
