jorgebucaran/fisher
lfiolhais/theme-simple-ass-prompt
IlanCosman/tide
jorgebucaran/replay.fish
jethrokuan/z
acomagu/fish-async-prompt
jorgebucaran/autopair.fish
franciscolourenco/done
